GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_rfc_dbell.h
/******************************************************************************
*  Filename:       hw_rfc_dbell.h
*  Revised:        2015-01-15 18:41:47 +0100 (to, 15 jan 2015)
*  Revision:       42400
*
* Copyright (c) 2015, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_RFC_DBELL_H__
#define __HW_RFC_DBELL_H__


//*****************************************************************************
//
// This section defines the register offsets of
// RFC_DBELL component
//
//*****************************************************************************
// Doorbell Command Register
#define RFC_DBELL_O_CMDR                                            0x00000000

// Doorbell Command Status Register
#define RFC_DBELL_O_CMDSTA                                          0x00000004

// Interrupt Flags From RF Hardware Modules
#define RFC_DBELL_O_RFHWIFG                                         0x00000008

// Interrupt Enable For RF Hardware Modules
#define RFC_DBELL_O_RFHWIEN                                         0x0000000C

// Interrupt Flags For Command and Packet Engine Generated Interrupts
#define RFC_DBELL_O_RFCPEIFG                                        0x00000010

// Interrupt Enable For Command and Packet Engine Generated Interrupts
#define RFC_DBELL_O_RFCPEIEN                                        0x00000014

// Interrupt Vector Selection For Command and Packet Engine Generated Interrupts
#define RFC_DBELL_O_RFCPEISL                                        0x00000018

// Doorbell Command Acknowledgement Interrupt Flag
#define RFC_DBELL_O_RFACKIFG                                        0x0000001C

// RF Core General Purpose Output Control
#define RFC_DBELL_O_SYSGPOCTL                                       0x00000020

//*****************************************************************************
//
// Register: RFC_DBELL_O_CMDR
//
//*****************************************************************************
// Field: [31:0] CMD
//
// Command register. Raises an interrupt to the Command and packet engine (CPE)
// upon write.
#define RFC_DBELL_CMDR_CMD_M                                        0xFFFFFFFF
#define RFC_DBELL_CMDR_CMD_S                                        0

//*****************************************************************************
//
// Register: RFC_DBELL_O_CMDSTA
//
//*****************************************************************************
// Field: [31:0] STAT
//
// Status of the last command used
#define RFC_DBELL_CMDSTA_STAT_M                                     0xFFFFFFFF
#define RFC_DBELL_CMDSTA_STAT_S                                     0

//*****************************************************************************
//
// Register: RFC_DBELL_O_RFHWIFG
//
//*****************************************************************************
// Field: [19]    RATCH7
//
// Radio timer channel 7 interrupt flag. Write zero to clear flag. Write to one has
// no effect.
#define RFC_DBELL_RFHWIFG_RATCH7                                    0x00080000
#define RFC_DBELL_RFHWIFG_RATCH7_BITN                               19
#define RFC_DBELL_RFHWIFG_RATCH7_M                                  0x00080000
#define RFC_DBELL_RFHWIFG_RATCH7_S                                  19

// Field: [18]    RATCH6
//
// Radio timer channel 6 interrupt flag. Write zero to clear flag. Write to one has
// no effect.
#define RFC_DBELL_RFHWIFG_RATCH6                                    0x00040000
#define RFC_DBELL_RFHWIFG_RATCH6_BITN                               18
#define RFC_DBELL_RFHWIFG_RATCH6_M                                  0x00040000
#define RFC_DBELL_RFHWIFG_RATCH6_S                                  18

// Field: [17]    RATCH5
//
// Radio timer channel 5 interrupt flag. Write zero to clear flag. Write to one has
// no effect.
#define RFC_DBELL_RFHWIFG_RATCH5                                    0x00020000
#define RFC_DBELL_RFHWIFG_RATCH5_BITN                               17
#define RFC_DBELL_RFHWIFG_RATCH5_M                                  0x00020000
#define RFC_DBELL_RFHWIFG_RATCH5_S                                  17

// Field: [16]    RATCH4
//
// Radio timer channel 4 interrupt flag. Write zero to clear flag. Write to one has
// no effect.
#define RFC_DBELL_RFHWIFG_RATCH4                                    0x00010000
#define RFC_DBELL_RFHWIFG_RATCH4_BITN                               16
#define RFC_DBELL_RFHWIFG_RATCH4_M                                  0x00010000
#define RFC_DBELL_RFHWIFG_RATCH4_S                                  16

