GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_rfc_dbell.h
// Field: [15]    RATCH3
//
// Interrupt enable for RFHWIFG.RATCH3.
#define RFC_DBELL_RFHWIEN_RATCH3                                    0x00008000
#define RFC_DBELL_RFHWIEN_RATCH3_BITN                               15
#define RFC_DBELL_RFHWIEN_RATCH3_M                                  0x00008000
#define RFC_DBELL_RFHWIEN_RATCH3_S                                  15

// Field: [14]    RATCH2
//
// Interrupt enable for RFHWIFG.RATCH2.
#define RFC_DBELL_RFHWIEN_RATCH2                                    0x00004000
#define RFC_DBELL_RFHWIEN_RATCH2_BITN                               14
#define RFC_DBELL_RFHWIEN_RATCH2_M                                  0x00004000
#define RFC_DBELL_RFHWIEN_RATCH2_S                                  14

// Field: [13]    RATCH1
//
// Interrupt enable for RFHWIFG.RATCH1.
#define RFC_DBELL_RFHWIEN_RATCH1                                    0x00002000
#define RFC_DBELL_RFHWIEN_RATCH1_BITN                               13
#define RFC_DBELL_RFHWIEN_RATCH1_M                                  0x00002000
#define RFC_DBELL_RFHWIEN_RATCH1_S                                  13

// Field: [12]    RATCH0
//
// Interrupt enable for RFHWIFG.RATCH0.
#define RFC_DBELL_RFHWIEN_RATCH0                                    0x00001000
#define RFC_DBELL_RFHWIEN_RATCH0_BITN                               12
#define RFC_DBELL_RFHWIEN_RATCH0_M                                  0x00001000
#define RFC_DBELL_RFHWIEN_RATCH0_S                                  12

// Field: [11]    RFESOFT2
//
// Interrupt enable for RFHWIFG.RFESOFT2.
#define RFC_DBELL_RFHWIEN_RFESOFT2                                  0x00000800
#define RFC_DBELL_RFHWIEN_RFESOFT2_BITN                             11
#define RFC_DBELL_RFHWIEN_RFESOFT2_M                                0x00000800
#define RFC_DBELL_RFHWIEN_RFESOFT2_S                                11

// Field: [10]    RFESOFT1
//
// Interrupt enable for RFHWIFG.RFESOFT1.
#define RFC_DBELL_RFHWIEN_RFESOFT1                                  0x00000400
#define RFC_DBELL_RFHWIEN_RFESOFT1_BITN                             10
#define RFC_DBELL_RFHWIEN_RFESOFT1_M                                0x00000400
#define RFC_DBELL_RFHWIEN_RFESOFT1_S                                10

// Field: [9]    RFESOFT0
//
// Interrupt enable for RFHWIFG.RFESOFT0.
#define RFC_DBELL_RFHWIEN_RFESOFT0                                  0x00000200
#define RFC_DBELL_RFHWIEN_RFESOFT0_BITN                             9
#define RFC_DBELL_RFHWIEN_RFESOFT0_M                                0x00000200
#define RFC_DBELL_RFHWIEN_RFESOFT0_S                                9

// Field: [8]    RFEDONE
//
// Interrupt enable for RFHWIFG.RFEDONE.
#define RFC_DBELL_RFHWIEN_RFEDONE                                   0x00000100
#define RFC_DBELL_RFHWIEN_RFEDONE_BITN                              8
#define RFC_DBELL_RFHWIEN_RFEDONE_M                                 0x00000100
#define RFC_DBELL_RFHWIEN_RFEDONE_S                                 8

// Field: [6]    TRCTK
//
// Interrupt enable for RFHWIFG.TRCTK.
#define RFC_DBELL_RFHWIEN_TRCTK                                     0x00000040
#define RFC_DBELL_RFHWIEN_TRCTK_BITN                                6
#define RFC_DBELL_RFHWIEN_TRCTK_M                                   0x00000040
#define RFC_DBELL_RFHWIEN_TRCTK_S                                   6

// Field: [5]    MDMSOFT
//
// Interrupt enable for RFHWIFG.MDMSOFT.
#define RFC_DBELL_RFHWIEN_MDMSOFT                                   0x00000020
#define RFC_DBELL_RFHWIEN_MDMSOFT_BITN                              5
#define RFC_DBELL_RFHWIEN_MDMSOFT_M                                 0x00000020
#define RFC_DBELL_RFHWIEN_MDMSOFT_S                                 5

// Field: [4]    MDMOUT
//
// Interrupt enable for RFHWIFG.MDMOUT.
#define RFC_DBELL_RFHWIEN_MDMOUT                                    0x00000010
#define RFC_DBELL_RFHWIEN_MDMOUT_BITN                               4
#define RFC_DBELL_RFHWIEN_MDMOUT_M                                  0x00000010
#define RFC_DBELL_RFHWIEN_MDMOUT_S                                  4

// Field: [3]    MDMIN
//
// Interrupt enable for RFHWIFG.MDMIN.
#define RFC_DBELL_RFHWIEN_MDMIN                                     0x00000008
#define RFC_DBELL_RFHWIEN_MDMIN_BITN                                3
#define RFC_DBELL_RFHWIEN_MDMIN_M                                   0x00000008
#define RFC_DBELL_RFHWIEN_MDMIN_S                                   3

// Field: [2]    MDMDONE
//
// Interrupt enable for RFHWIFG.MDMDONE.
#define RFC_DBELL_RFHWIEN_MDMDONE                                   0x00000004
#define RFC_DBELL_RFHWIEN_MDMDONE_BITN                              2
#define RFC_DBELL_RFHWIEN_MDMDONE_M                                 0x00000004
#define RFC_DBELL_RFHWIEN_MDMDONE_S                                 2

// Field: [1]    FSCA
//
// Interrupt enable for RFHWIFG.FSCA.
#define RFC_DBELL_RFHWIEN_FSCA                                      0x00000002
#define RFC_DBELL_RFHWIEN_FSCA_BITN                                 1
#define RFC_DBELL_RFHWIEN_FSCA_M                                    0x00000002
#define RFC_DBELL_RFHWIEN_FSCA_S                                    1

//*****************************************************************************
//
// Register: RFC_DBELL_O_RFCPEIFG
//
//*****************************************************************************
// Field: [31]    INTERNAL_ERROR
//
// Interrupt flag 31. The command and packet engine (CPE) has observed an
// unexpected error. A reset of the CPE is needed. This can be done by switching the
// RF Core power domain off and on in PRCM:PDCTL1RFC. Write zero to clear flag.
// Write to one has no effect.
#define RFC_DBELL_RFCPEIFG_INTERNAL_ERROR                           0x80000000
#define RFC_DBELL_RFCPEIFG_INTERNAL_ERROR_BITN                      31
#define RFC_DBELL_RFCPEIFG_INTERNAL_ERROR_M                         0x80000000
#define RFC_DBELL_RFCPEIFG_INTERNAL_ERROR_S                         31

