GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_rfc_dbell.h
// Field: [30]    BOOT_DONE
//
// Interrupt flag 30. The command and packet engine (CPE) boot is finished. Write
// zero to clear flag. Write to one has no effect.
#define RFC_DBELL_RFCPEIFG_BOOT_DONE                                0x40000000
#define RFC_DBELL_RFCPEIFG_BOOT_DONE_BITN                           30
#define RFC_DBELL_RFCPEIFG_BOOT_DONE_M                              0x40000000
#define RFC_DBELL_RFCPEIFG_BOOT_DONE_S                              30

// Field: [29]    MODULES_UNLOCKED
//
// Interrupt flag 29. As part of command and packet engine (CPE) boot process, it
// has opened access to RF Core modules and memories. Write zero to clear flag.
// Write to one has no effect.
#define RFC_DBELL_RFCPEIFG_MODULES_UNLOCKED                         0x20000000
#define RFC_DBELL_RFCPEIFG_MODULES_UNLOCKED_BITN                    29
#define RFC_DBELL_RFCPEIFG_MODULES_UNLOCKED_M                       0x20000000
#define RFC_DBELL_RFCPEIFG_MODULES_UNLOCKED_S                       29

// Field: [28]    SYNTH_NO_LOCK
//
// Interrupt flag 28. The phase-locked loop in frequency synthesizer has reported
// loss of lock. Write zero to clear flag. Write to one has no effect.
#define RFC_DBELL_RFCPEIFG_SYNTH_NO_LOCK                            0x10000000
#define RFC_DBELL_RFCPEIFG_SYNTH_NO_LOCK_BITN                       28
#define RFC_DBELL_RFCPEIFG_SYNTH_NO_LOCK_M                          0x10000000
#define RFC_DBELL_RFCPEIFG_SYNTH_NO_LOCK_S                          28

// Field: [27]    IRQ27
//
// Interrupt flag 27. Write zero to clear flag. Write to one has no effect.
#define RFC_DBELL_RFCPEIFG_IRQ27                                    0x08000000
#define RFC_DBELL_RFCPEIFG_IRQ27_BITN                               27
#define RFC_DBELL_RFCPEIFG_IRQ27_M                                  0x08000000
#define RFC_DBELL_RFCPEIFG_IRQ27_S                                  27

// Field: [26]    RX_ABORTED
//
// Interrupt flag 26. Packet reception stopped before packet was done. Write zero
// to clear flag. Write to one has no effect.
#define RFC_DBELL_RFCPEIFG_RX_ABORTED                               0x04000000
#define RFC_DBELL_RFCPEIFG_RX_ABORTED_BITN                          26
#define RFC_DBELL_RFCPEIFG_RX_ABORTED_M                             0x04000000
#define RFC_DBELL_RFCPEIFG_RX_ABORTED_S                             26

// Field: [25]    RX_N_DATA_WRITTEN
//
// Interrupt flag 25. Specified number of bytes written to partial read Rx buffer.
// Write zero to clear flag. Write to one has no effect.
#define RFC_DBELL_RFCPEIFG_RX_N_DATA_WRITTEN                        0x02000000
#define RFC_DBELL_RFCPEIFG_RX_N_DATA_WRITTEN_BITN                   25
#define RFC_DBELL_RFCPEIFG_RX_N_DATA_WRITTEN_M                      0x02000000
#define RFC_DBELL_RFCPEIFG_RX_N_DATA_WRITTEN_S                      25

// Field: [24]    RX_DATA_WRITTEN
//
// Interrupt flag 24. Data written to partial read Rx buffer. Write zero to clear
// flag. Write to one has no effect.
#define RFC_DBELL_RFCPEIFG_RX_DATA_WRITTEN                          0x01000000
#define RFC_DBELL_RFCPEIFG_RX_DATA_WRITTEN_BITN                     24
#define RFC_DBELL_RFCPEIFG_RX_DATA_WRITTEN_M                        0x01000000
#define RFC_DBELL_RFCPEIFG_RX_DATA_WRITTEN_S                        24

// Field: [23]    RX_ENTRY_DONE
//
// Interrupt flag 23. Rx queue data entry changing state to finished.  Write zero
// to clear flag. Write to one has no effect.
#define RFC_DBELL_RFCPEIFG_RX_ENTRY_DONE                            0x00800000
#define RFC_DBELL_RFCPEIFG_RX_ENTRY_DONE_BITN                       23
#define RFC_DBELL_RFCPEIFG_RX_ENTRY_DONE_M                          0x00800000
#define RFC_DBELL_RFCPEIFG_RX_ENTRY_DONE_S                          23

// Field: [22]    RX_BUF_FULL
//
// Interrupt flag 22. Packet received that did not fit in Rx queue. BLE mode:
// Packet received that did not fit in the Rx queue. IEEE 802.15.4 mode: Frame
// received that did not fit in the Rx queue. Write zero to clear flag. Write to one
// has no effect.
#define RFC_DBELL_RFCPEIFG_RX_BUF_FULL                              0x00400000
#define RFC_DBELL_RFCPEIFG_RX_BUF_FULL_BITN                         22
#define RFC_DBELL_RFCPEIFG_RX_BUF_FULL_M                            0x00400000
#define RFC_DBELL_RFCPEIFG_RX_BUF_FULL_S                            22

// Field: [21]    RX_CTRL_ACK
//
// Interrupt flag 21. BLE mode only: LL control packet received with CRC OK, not to
// be ignored, then acknowledgement sent. Write zero to clear flag. Write to one has
// no effect.
#define RFC_DBELL_RFCPEIFG_RX_CTRL_ACK                              0x00200000
#define RFC_DBELL_RFCPEIFG_RX_CTRL_ACK_BITN                         21
#define RFC_DBELL_RFCPEIFG_RX_CTRL_ACK_M                            0x00200000
#define RFC_DBELL_RFCPEIFG_RX_CTRL_ACK_S                            21

// Field: [20]    RX_CTRL
//
// Interrupt flag 20. BLE mode only: LL control packet received with CRC OK, not to
// be ignored. Write zero to clear flag. Write to one has no effect.
#define RFC_DBELL_RFCPEIFG_RX_CTRL                                  0x00100000
#define RFC_DBELL_RFCPEIFG_RX_CTRL_BITN                             20
#define RFC_DBELL_RFCPEIFG_RX_CTRL_M                                0x00100000
#define RFC_DBELL_RFCPEIFG_RX_CTRL_S                                20

// Field: [19]    RX_EMPTY
//
// Interrupt flag 19. BLE mode only: Packet received with CRC OK, not to be
// ignored, no payload. Write zero to clear flag. Write to one has no effect.
#define RFC_DBELL_RFCPEIFG_RX_EMPTY                                 0x00080000
#define RFC_DBELL_RFCPEIFG_RX_EMPTY_BITN                            19
#define RFC_DBELL_RFCPEIFG_RX_EMPTY_M                               0x00080000
#define RFC_DBELL_RFCPEIFG_RX_EMPTY_S                               19

// Field: [18]    RX_IGNORED
//
// Interrupt flag 18. Packet received, but can be ignored. BLE mode: Packet
// received with CRC OK, but to be ignored. IEEE 802.15.4 mode: Frame received with
// ignore flag set. Write zero to clear flag. Write to one has no effect.
#define RFC_DBELL_RFCPEIFG_RX_IGNORED                               0x00040000
#define RFC_DBELL_RFCPEIFG_RX_IGNORED_BITN                          18
#define RFC_DBELL_RFCPEIFG_RX_IGNORED_M                             0x00040000
#define RFC_DBELL_RFCPEIFG_RX_IGNORED_S                             18

// Field: [17]    RX_NOK
//
// Interrupt flag 17. Packet received with CRC error. BLE mode: Packet received
// with CRC error. IEEE 802.15.4 mode: Frame received with CRC error. Write zero to
// clear flag. Write to one has no effect.
#define RFC_DBELL_RFCPEIFG_RX_NOK                                   0x00020000
#define RFC_DBELL_RFCPEIFG_RX_NOK_BITN                              17
#define RFC_DBELL_RFCPEIFG_RX_NOK_M                                 0x00020000
#define RFC_DBELL_RFCPEIFG_RX_NOK_S                                 17

// Field: [16]    RX_OK
//
// Interrupt flag 16. Packet received correctly. BLE mode: Packet received with CRC
// OK, payload, and not to be ignored. IEEE 802.15.4 mode: Frame received with CRC
// OK. Write zero to clear flag. Write to one has no effect.
#define RFC_DBELL_RFCPEIFG_RX_OK                                    0x00010000
#define RFC_DBELL_RFCPEIFG_RX_OK_BITN                               16
#define RFC_DBELL_RFCPEIFG_RX_OK_M                                  0x00010000
#define RFC_DBELL_RFCPEIFG_RX_OK_S                                  16

// Field: [15]    IRQ15
//
// Interrupt flag 15. Write zero to clear flag. Write to one has no effect.
#define RFC_DBELL_RFCPEIFG_IRQ15                                    0x00008000
#define RFC_DBELL_RFCPEIFG_IRQ15_BITN                               15
#define RFC_DBELL_RFCPEIFG_IRQ15_M                                  0x00008000
#define RFC_DBELL_RFCPEIFG_IRQ15_S                                  15

// Field: [14]    IRQ14
//
// Interrupt flag 14. Write zero to clear flag. Write to one has no effect.
#define RFC_DBELL_RFCPEIFG_IRQ14                                    0x00004000
#define RFC_DBELL_RFCPEIFG_IRQ14_BITN                               14
#define RFC_DBELL_RFCPEIFG_IRQ14_M                                  0x00004000
#define RFC_DBELL_RFCPEIFG_IRQ14_S                                  14

// Field: [13]    IRQ13
//
// Interrupt flag 13. Write zero to clear flag. Write to one has no effect.
#define RFC_DBELL_RFCPEIFG_IRQ13                                    0x00002000
#define RFC_DBELL_RFCPEIFG_IRQ13_BITN                               13
#define RFC_DBELL_RFCPEIFG_IRQ13_M                                  0x00002000
#define RFC_DBELL_RFCPEIFG_IRQ13_S                                  13

// Field: [12]    BG_COMMAND_SUSPENDED
//
// Interrupt flag 12. IEEE 802.15.4 mode only: A background level radio operation
// command has been suspended. Write zero to clear flag. Write to one has no effect.
#define RFC_DBELL_RFCPEIFG_BG_COMMAND_SUSPENDED                     0x00001000
#define RFC_DBELL_RFCPEIFG_BG_COMMAND_SUSPENDED_BITN                12
#define RFC_DBELL_RFCPEIFG_BG_COMMAND_SUSPENDED_M                   0x00001000
#define RFC_DBELL_RFCPEIFG_BG_COMMAND_SUSPENDED_S                   12

