GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_rfc_dbell.h
// Field: [11]    TX_BUFFER_CHANGED
//
// Interrupt flag 11. BLE mode only: A buffer change is complete after
// CMD_BLE_ADV_PAYLOAD. Write zero to clear flag. Write to one has no effect.
#define RFC_DBELL_RFCPEIFG_TX_BUFFER_CHANGED                        0x00000800
#define RFC_DBELL_RFCPEIFG_TX_BUFFER_CHANGED_BITN                   11
#define RFC_DBELL_RFCPEIFG_TX_BUFFER_CHANGED_M                      0x00000800
#define RFC_DBELL_RFCPEIFG_TX_BUFFER_CHANGED_S                      11

// Field: [10]    TX_ENTRY_DONE
//
// Interrupt flag 10. Tx queue data entry state changed to finished. Write zero to
// clear flag. Write to one has no effect.
#define RFC_DBELL_RFCPEIFG_TX_ENTRY_DONE                            0x00000400
#define RFC_DBELL_RFCPEIFG_TX_ENTRY_DONE_BITN                       10
#define RFC_DBELL_RFCPEIFG_TX_ENTRY_DONE_M                          0x00000400
#define RFC_DBELL_RFCPEIFG_TX_ENTRY_DONE_S                          10

// Field: [9]    TX_RETRANS
//
// Interrupt flag 9. BLE mode only: Packet retransmitted. Write zero to clear flag.
// Write to one has no effect.
#define RFC_DBELL_RFCPEIFG_TX_RETRANS                               0x00000200
#define RFC_DBELL_RFCPEIFG_TX_RETRANS_BITN                          9
#define RFC_DBELL_RFCPEIFG_TX_RETRANS_M                             0x00000200
#define RFC_DBELL_RFCPEIFG_TX_RETRANS_S                             9

// Field: [8]    TX_CTRL_ACK_ACK
//
// Interrupt flag 8. BLE mode only: Acknowledgement received on a transmitted LL
// control packet, and acknowledgement transmitted for that packet. Write zero to
// clear flag. Write to one has no effect.
#define RFC_DBELL_RFCPEIFG_TX_CTRL_ACK_ACK                          0x00000100
#define RFC_DBELL_RFCPEIFG_TX_CTRL_ACK_ACK_BITN                     8
#define RFC_DBELL_RFCPEIFG_TX_CTRL_ACK_ACK_M                        0x00000100
#define RFC_DBELL_RFCPEIFG_TX_CTRL_ACK_ACK_S                        8

// Field: [7]    TX_CTRL_ACK
//
// Interrupt flag 7. BLE mode: Acknowledgement received on a transmitted LL control
// packet. Write zero to clear flag. Write to one has no effect.
#define RFC_DBELL_RFCPEIFG_TX_CTRL_ACK                              0x00000080
#define RFC_DBELL_RFCPEIFG_TX_CTRL_ACK_BITN                         7
#define RFC_DBELL_RFCPEIFG_TX_CTRL_ACK_M                            0x00000080
#define RFC_DBELL_RFCPEIFG_TX_CTRL_ACK_S                            7

// Field: [6]    TX_CTRL
//
// Interrupt flag 6. BLE mode: Transmitted LL control packet. Write zero to clear
// flag. Write to one has no effect.
#define RFC_DBELL_RFCPEIFG_TX_CTRL                                  0x00000040
#define RFC_DBELL_RFCPEIFG_TX_CTRL_BITN                             6
#define RFC_DBELL_RFCPEIFG_TX_CTRL_M                                0x00000040
#define RFC_DBELL_RFCPEIFG_TX_CTRL_S                                6

// Field: [5]    TX_ACK
//
// Interrupt flag 5. BLE mode: Acknowledgement received on a transmitted packet.
// IEEE 802.15.4 mode: Transmitted automatic ACK frame. Write zero to clear flag.
// Write to one has no effect.
#define RFC_DBELL_RFCPEIFG_TX_ACK                                   0x00000020
#define RFC_DBELL_RFCPEIFG_TX_ACK_BITN                              5
#define RFC_DBELL_RFCPEIFG_TX_ACK_M                                 0x00000020
#define RFC_DBELL_RFCPEIFG_TX_ACK_S                                 5

// Field: [4]    TX_DONE
//
// Interrupt flag 4. Packet transmitted. (BLE mode: A packet has been transmitted.)
// (IEEE 802.15.4 mode: A frame has been transmitted). Write zero to clear flag.
// Write to one has no effect.
#define RFC_DBELL_RFCPEIFG_TX_DONE                                  0x00000010
#define RFC_DBELL_RFCPEIFG_TX_DONE_BITN                             4
#define RFC_DBELL_RFCPEIFG_TX_DONE_M                                0x00000010
#define RFC_DBELL_RFCPEIFG_TX_DONE_S                                4

// Field: [3]    LAST_FG_COMMAND_DONE
//
// Interrupt flag 3. IEEE 802.15.4 mode only: The last foreground radio operation
// command in a chain of commands has finished. Write zero to clear flag. Write to
// one has no effect.
#define RFC_DBELL_RFCPEIFG_LAST_FG_COMMAND_DONE                     0x00000008
#define RFC_DBELL_RFCPEIFG_LAST_FG_COMMAND_DONE_BITN                3
#define RFC_DBELL_RFCPEIFG_LAST_FG_COMMAND_DONE_M                   0x00000008
#define RFC_DBELL_RFCPEIFG_LAST_FG_COMMAND_DONE_S                   3

// Field: [2]    FG_COMMAND_DONE
//
// Interrupt flag 2. IEEE 802.15.4 mode only: A foreground radio operation command
// has finished. Write zero to clear flag. Write to one has no effect.
#define RFC_DBELL_RFCPEIFG_FG_COMMAND_DONE                          0x00000004
#define RFC_DBELL_RFCPEIFG_FG_COMMAND_DONE_BITN                     2
#define RFC_DBELL_RFCPEIFG_FG_COMMAND_DONE_M                        0x00000004
#define RFC_DBELL_RFCPEIFG_FG_COMMAND_DONE_S                        2

// Field: [1]    LAST_COMMAND_DONE
//
// Interrupt flag 1. The last radio operation command in a chain of commands has
// finished. (IEEE 802.15.4 mode: The last background level radio operation command
// in a chain of commands has finished.) Write zero to clear flag. Write to one has
// no effect.
#define RFC_DBELL_RFCPEIFG_LAST_COMMAND_DONE                        0x00000002
#define RFC_DBELL_RFCPEIFG_LAST_COMMAND_DONE_BITN                   1
#define RFC_DBELL_RFCPEIFG_LAST_COMMAND_DONE_M                      0x00000002
#define RFC_DBELL_RFCPEIFG_LAST_COMMAND_DONE_S                      1

// Field: [0]    COMMAND_DONE
//
// Interrupt flag 0. A radio operation has finished. (IEEE 802.15.4 mode: A
// background level radio operation command has finished.) Write zero to clear flag.
// Write to one has no effect.
#define RFC_DBELL_RFCPEIFG_COMMAND_DONE                             0x00000001
#define RFC_DBELL_RFCPEIFG_COMMAND_DONE_BITN                        0
#define RFC_DBELL_RFCPEIFG_COMMAND_DONE_M                           0x00000001
#define RFC_DBELL_RFCPEIFG_COMMAND_DONE_S                           0

//*****************************************************************************
//
// Register: RFC_DBELL_O_RFCPEIEN
//
//*****************************************************************************
// Field: [31]    INTERNAL_ERROR
//
// Interrupt enable for RFCPEIFG.INTERNAL_ERROR.
#define RFC_DBELL_RFCPEIEN_INTERNAL_ERROR                           0x80000000
#define RFC_DBELL_RFCPEIEN_INTERNAL_ERROR_BITN                      31
#define RFC_DBELL_RFCPEIEN_INTERNAL_ERROR_M                         0x80000000
#define RFC_DBELL_RFCPEIEN_INTERNAL_ERROR_S                         31

